/*
무한히 큰 배열에 다음과 같이 분수들이 적혀있다.
1/1 	1/2 	1/3 	1/4 	1/5 	…
2/1 	2/2 	2/3 	2/4 	… 	    …
3/1 	3/2 	3/3 	… 	    … 	    …
4/1 	4/2 	… 	    … 	    … 	    …
5/1 	…   	… 	    … 	    … 	    …
…   	… 	    … 	    … 	    … 	    …

이와 같이 나열된 분수들을 1/1 -> 1/2 -> 2/1 -> 3/1 -> 2/2 -> … 과 같은 지그재그 순서로 차례대로 1번, 2번, 3번, 4번, 5번, … 분수라고 하자.

X가 주어졌을 때, X번째 분수를 구하는 프로그램을 작성하시오.

풀이방법
좌표를 찾으면 될것같다.
1 =     1,1

2 =     1,2
3 =     2,1

4 =     3,1
5 =     2,2
6 =     1,3

7 =     1,4
8 =     2,3
9 =     3,2
10 =    4,1

11 =    5,1
12 =    4,2
13 =    3,3
14 =    2,4
15 =    1,5

홀수일때 1234/4321
짝수일때 4321/1234

*/
#include <iostream>
using namespace std;
int main(){
    int n,cnt=0;
    cin >> n;
    for(int i=1;;i++){
        for(int j=1;j<=i;j++){
            cnt++;
            if(cnt == n){
                if(i%2==0)
                    printf("%d/%d",j,i-j+1);
                else
                    printf("%d/%d",i-j+1,j);
                break;
            }
        }
        if(cnt == n){
            break;
        }
    }
}
